Tekla Open API Reference for Tekla Structures 2025
BinaryFilterExpression Constructor
Overload List
Name | Description
BinaryFilterExpression(BooleanFilterExpression, BooleanOperatorType, BooleanConstantFilterExpression)
 Initializes a new instance of the BinaryFilterExpression class.
BinaryFilterExpression(DateTimeFilterExpression, DateTimeOperatorType, DateTimeConstantFilterExpression)
 Initializes a new instance of the BinaryFilterExpression class.
BinaryFilterExpression(NumericFilterExpression, NumericOperatorType, NumericConstantFilterExpression)
 Initializes a new instance of the BinaryFilterExpression class.
BinaryFilterExpression(StringFilterExpression, StringOperatorType, StringConstantFilterExpression)
 Initializes a new instance of the BinaryFilterExpression class.
Top
See Also
Reference
BinaryFilterExpression Class
Tekla.Structures.Filtering Namespace